# House Robber (Грабитель домов) — Динамическое программирование

## Описание задачи

Вы — профессиональный грабитель, собираетесь ограбить дома, стоящие в ряд. В каждом доме хранится определённая сумма денег, заданная массивом `nums`.  
Нельзя грабить два соседних дома подряд (у них общая сигнализация).  
Найдите максимальную сумму, которую вы сможете забрать за одну ночь, не вызвав полицию.

**Пример:**  
Вход: nums = [2,7,9,3,1]  
Выход: 12  
Пояснение: Грабим 1-й (2) + 3-й (9) + 5-й (1) = 12.

---

## Идея и подход

- Используем динамическое программирование:  
  - `dp[i]` — максимальная сумма, которую можно получить с первых `i` домов.
  - Для каждого дома:
    - Либо грабим его (добавляем сумму к dp[i-2]),
    - Либо пропускаем (берём dp[i-1]).
  - Ответ: максимум из `dp[i-1]` и `dp[i-2] + nums[i]` для каждого `i`.

---

## Пример на Python

```python
def rob(nums):
    prev1 = 0
    prev2 = 0
    for num in nums:
        temp = prev1
        prev1 = max(prev2 + num, prev1)
        prev2 = temp
    return prev1

# Пример использования:
print(rob([2,7,9,3,1]))  # Вывод: 12
```

---

## Анализ сложности

- **Время:** O(n), где n — количество домов.
- **Память:** O(1), используется только постоянное количество памяти.

---

## Применения

- Планирование с ограничениями по смежности
- Оптимальное распределение ресурсов с условиями

---

## Полезные ссылки

- [House Robber — LeetCode (англ.)](https://leetcode.com/problems/house-robber/)
- [Dynamic Programming — GeeksforGeeks (англ.)](https://www.geeksforgeeks.org/maximum-sum-such-that-no-two-elements-are-adjacent/)
- [Wikipedia: Динамическое программирование](https://ru.wikipedia.org/wiki/Динамическое_программирование)

---

## LeetCode — задачи для практики

| Сложность | Задача                  | Ссылка                                                                             |
|-----------|-------------------------|------------------------------------------------------------------------------------|
| Средняя   | House Robber            | [#198 House Robber](https://leetcode.com/problems/house-robber/)                   |
| Средняя   | House Robber II         | [#213 House Robber II](https://leetcode.com/problems/house-robber-ii/)             |
| Средняя   | Delete and Earn         | [#740 Delete and Earn](https://leetcode.com/problems/delete-and-earn/)             |

---