# Получение i-го бита числа

## Описание задачи

Дано целое число `n` и индекс `i` (позиция бита, обычно нумерация с нуля — справа налево).  
Определите значение (0 или 1) бита на позиции `i` в двоичном представлении числа `n`.

---

## Идея и подход

- Чтобы узнать i-й бит, сдвигаем число `n` вправо на `i` позиций: `n >> i`.
- Затем применяем побитовое И с 1: `(n >> i) & 1`.
    - Если результат 1 — i-й бит установлен.
    - Если 0 — i-й бит равен нулю.

---

## Пример на Python

```python
def get_ith_bit(n, i):
    return (n >> i) & 1

# Примеры:
print(get_ith_bit(13, 0))  # 1 (13 = 1101, 0-й бит — 1)
print(get_ith_bit(13, 1))  # 0 (1-й бит — 0)
print(get_ith_bit(13, 2))  # 1 (2-й бит — 1)
print(get_ith_bit(13, 3))  # 1 (3-й бит — 1)
```

---

## Как это работает

- `n >> i` — сдвигает интересующий бит на место младшего (0-го).
- `& 1` — оставляет только младший бит (0 или 1).

---

## Таблица: Примеры

| n   | Двоичное | i | get_ith_bit(n, i) | Пояснение           |
|-----|----------|---|-------------------|---------------------|
| 13  | 1101     | 0 | 1                 | младший бит — 1     |
| 13  | 1101     | 1 | 0                 | следующий бит — 0   |
| 13  | 1101     | 2 | 1                 | третий бит — 1      |
| 13  | 1101     | 3 | 1                 | старший бит — 1     |
| 8   | 1000     | 3 | 1                 | только 3-й бит — 1  |
| 8   | 1000     | 2 | 0                 | биты 2,1,0 — нули   |

---

## Применение

- Проверка состояния флага в битовой маске.
- Битовые алгоритмы и оптимизация.
- Комбинаторные задачи, кодирование признаков, права доступа.

---

## Полезные ссылки

- [Побитовые операции — Википедия](https://ru.wikipedia.org/wiki/Побитовые_операции)
- [Python: побитовые операторы — GeeksforGeeks (en)](https://www.geeksforgeeks.org/python-bitwise-operators/)

---